{
    "Projects" : [
    {
        "id": 0,
        "projectName": "Room Design",
        "linkname": "roomdesign",
        "link": "https://rob-noyes.github.io/room-homepage/",
        "github": "https://github.com/rob-noyes/room-homepage",
        "tags": "Javascript / ReactJS / TailwindCSS",
        "description": "Room Design is built using React.js and TailwindCSS.  Utilizing these frameworks, I created a functional front-end site that includes some featues I have never worked on before.",
        "Content": "By creating a shopping cart within the site, I was able to use React States to add items to an overall cart, as well as changing the quantity or deleting from the cart itself.  This was the biggest challenge I had, but implementing and seeing it work was a huge success for me.  I also used states and React Router for the navigation bar on mobile, allowing for the user to change pages.  Finally, I created this site using a mobile-first approach, allowing the user to use this site in mobile, tablet, or desktop form, with different layouts depending on the size of the screen. Overall, I found that states are much more difficult in a multi paged site, and am looking forward to learning some Redux to help with states on a project of a larger size.",
        "images": [
            "./images/projects/room/desktop1.png", "./images/projects/room/desktop2.png"
        ],
        "alt": "room design website, contemporary furniture",
        "color": "#ecb6b6"
    },
    {
        "id": 1,
        "projectName": "Tip Jar",
        "linkname": "tipjar",
        "link": "https://rob-noyes.github.io/tip-jar/",
        "github": "https://github.com/rob-noyes/room-homepage",
        "tags": "Javascript / ReactJS / TailwindCSS",
        "description": "Tip Jar was created from the thought of having a quick and easy way to figure out a tip without needing to do the math yourself.",
        "Content": "Utilizing React.js and using TailwindCSS for the first time, I wanted to focus on buidling a good looking web app.  Using react states allowed for me to carry the balance of the check, and utilize different states based on the tip percentage clicked, or set a specific amount.  By using Tailwind, I was able to quickly put together a clean looking site.  I even delved into the specifics of adding my own stlyes through color optiosn and font inside of tailwind configs extend option. Overall I a, happy with the process and learned a lot on how states and tailwind work.",
        "images": [
            "./images/projects/tipjar/desktop.png", "./images/projects/tipjar/mobile.png"
        ],
        "alt": "tipjar website, calculator for tips",
        "color": "#b6d8ec"
    },
    {
        "id": 2,
        "projectName": "Cast",
        "linkname": "cast",
        "link": "https://rob-noyes.github.io/Cast/",
        "github": "",
        "tags": "Vanilla Javascript / CSS",
        "description": "",
        "images": [
            "./images/projects/cast/castDesktop.png"
        ],
        "color": "#b6ecb6"
    }
]
}